<template>
  <div class="container-fluid dsp-content-container">
    <n-tabs type="line" animated>
      <n-tab-pane name="chart" tab="Chart" display-directive="show:lazy">
        Graphic
      </n-tab-pane>
      <n-tab-pane name="theory" tab="Theory" display-directive="show:lazy">
        <div class="p-3 theory-content-card">
          <h4>Сигнал</h4>
          <p>
            <em>Сигналом</em> называется физический процесс, параметры которого изменяются в соответствии с передаваемым
            сообщением.
            Cигнал является материальным носителем информации. По способу представления сигналы разделяются на две
            группы
            -
            <em>случайные</em> и <em>детерминированные</em>. Их описывают математической моделью или функцией,
            характеризующей изменение
            параметров сигнала.
          </p>
          <p>
            <em>Случайным</em> сигналом называют функцию времени, значения которой заранее неизвестны и могут быть
            предсказаны
            лишь
            с
            некоторой <em>вероятностью</em>. К основным характеристикам случайных сигналов относятся:
          </p>
          <ul>
            <li>закон распределения (относительное время пребывания значения сигнала в определенном интервале),</li>
            <li> спектральное распределение мощности.</li>
          </ul>
          <p>
            <em>Детерминированные</em> сигналы описываются аналитической функцией (задаются аналитически), и их поведение
            полностью
            известно в любой момент времени. Детерминированные сигналы в свою очередь бывают <em>периодическими</em> и
            <em>непериодическими</em>. Непериодические сигналы, как правило, ограничены во времени.
          </p>
          <p><em>Периодический</em> сигнал - это сигнал, который повторяется во времени с определенным периодом, то есть
            для
            которого выполняется условие:</p>
          <equation-wrapper v-model="equation.e_1_1"></equation-wrapper>
          <p>где <em>k</em> - любое целое число, <em>T</em> - период повторения.</p>
          <p>Пример <em>периодического</em> сигнала - гармоническое колебание, описываемое следующим выражением:</p>
          <equation-wrapper v-model="equation.e_1_2"></equation-wrapper>
          <p>Известно, что любой сложный периодический сигнал может быть представлен в виде суммы гармонических колебаний
            с
            частотами, кратными основной частоте <equation-wrapper v-model="localEquation.e_1"></equation-wrapper></p>
          <h4>Цифровые сигналы</h4>
          <p>Все сигналы можно разделить на четыре группы:</p>
          <ul>
            <li>аналоговые,</li>
            <li>дискретные,</li>
            <li>квантованные,</li>
            <li>цифровые.</li>
          </ul>
          <p><strong>Аналоговый</strong> сигнал - описывается непрерывной функцией времени. Аналоговый сигнал обеспечивает
            передачу данных путем непрерывного изменения во времени амплитуды, частоты или фазы. Практически все
            физические
            процессы описываются непрерывными функциями времени, поэтому представляют собой аналоговые сигналы. Для
            аналогового сигнала область значений и определения описывается <em>непрерывным множеством</em>.</p>
          <p>Для <strong>дискретного</strong> сигнала свойственно прерывистое (дискретное) изменение сигнала во времени.
            То
            есть изменения в сигнале происходят скачкообразно через некоторые промежутки времени, называемые интервалом
            дискретизации - Δt или Td. Дискретизация <em>аналогового сигнала</em> состоит в том, что сигнал представляется
            в
            виде последовательности значений, взятых в дискретные моменты времени, которые называются <em>отсчётами</em>
            (сэмплами).</p>
          <p>Для правильного восстановления аналогового сигнала из цифрового без искажений и потерь используется теорема
            отсчетов, известная как <strong>теорема Котельникова (Найквиста-Шеннона)</strong>.</p>
          <blockquote>
            <p>Любой непрерывный сигнал с ограниченным спектром может быть восстановлен однозначно и без потерь по своим
              дискретным отсчетам, взятым с частотой строго больше удвоенной верхней частоты спектра непрерывного сигнала.
            </p>
          </blockquote>
          <p>Формула теоремы Котельникова:</p>
          <equation-wrapper v-model="equation.e_1_3"></equation-wrapper>
          <p>где</p>
          <ul>
            <li>F<sub>s</sub> - частота дискретизации сигнала,</li>
            <li>F<sub>a</sub> - верхняя частота спектра аналогового сигнала.</li>
          </ul>
          <p>Такое определение относится к функциям времени, которые состоят из частот от нуля до
            <equation-wrapper v-model="localEquation.F_a"></equation-wrapper>
          </p>
          <p>В реальных задачах в радиотехнике спектр сигнала может лежать в любом диапазоне частот и начинаться и
            заканчиваться на любой частоте, в связи с этим определение Теоремы Котельникова правильно рассматривать
            относительно ширины спектра такого сигнала:</p>
          <blockquote>
            <p>Любой непрерывный сигнал с ограниченным спектром может быть восстановлен однозначно и без потерь по своим
              дискретным отсчетам, взятым с частотой строго больше удвоенной ширины полосы частот, занимаемой спектром
              непрерывного сигнала.</p>
          </blockquote>
          <equation-wrapper v-model="equation.e_1_4"></equation-wrapper>
          <p>где <equation-wrapper v-model="localEquation.e_2"></equation-wrapper> - ширина спектра непрерывного сигнала.
          </p>
          <p><strong>Квантованные</strong> сигналы принимают ряд конечных значений из диапазона непрерывных или дискретных
            величин. Как правило, сигналы квантуются по уровню, то есть по амплитуде.</p>
          <p><strong>Цифровые</strong> сигналы получаются из аналоговых с помощью операций <strong>дискретизации</strong>
            и
            <strong>квантования</strong> по уровню. Значениям цифрового сигнала присваивается кодовое слово или набор
            символов (зачастую двоичных).
          </p>
          <p>Устройства, осуществляющие дискретизацию по времени и квантование по уровню, называются
            <strong>аналого-цифровыми преобразователями (АЦП)</strong>.
            Устройства, переводящие цифровой сигнал в аналоговый называются <strong>цифро-аналоговыми преобразователями
              (ЦАП)</strong>.
          </p>
          <h4>Дискретные последовательности</h4>
          <p><strong>Дискретной последовательностью</strong> называется математическая модель дискретного сигнала,
            представляющая собой решетчатую функцию: x(nT) = x(n), где <em>T</em> - интервал дискретизации, <em>n</em> =
            0,
            1, 2, ..., N-1 - отсчёты или сэмплы.</p>
          <p>Пример конечной дискретной последовательности <code>x(nT) = {2, 1, -2, 0, 2, 3, 1, 0}</code>. Данная
            последовательность выглядит, как показано на рисунке:</p>
          <h4>Дельта-функция</h4>
          <p><strong>Единичный импульс</strong> - простейшая дискретная последовательность. Это дискретная δ-функция δ(nT)
            <em>Дирака</em>, которая равна единице при n = 0 и нулю при всех остальных значениях n.
          </p>
          <p>Дискретная δ-функция, смещенная во времени на <strong>m</strong> тактовых интервалов, записывается следующим
            образом: <code>δ(nT-mT)</code>.</p>
          <h4>Единичный скачок</h4>
          <p>Единичный скачок или <strong>функция Хевисайда</strong> - еще один вид простых и важных дискретных
            последовательностей. Он принимает нулевые значения в отрицательной области времени и единичные значения в
            положительной.</p>
          <p>Математически функция единичного скачка записывается как:</p>
          <equation-wrapper v-model="equation.e_1_5"></equation-wrapper>
          <p>Дискретный единичный скачок <code>σ(n)</code> и дискретная δ-функция <code>δ(n)</code> связаны между собой
            следующими соотношениями:</p>
          <equation-wrapper v-model="equation.e_1_6"></equation-wrapper>
          <equation-wrapper v-model="equation.e_1_7"></equation-wrapper>
          <p>Произвольная дискретная последовательность может быть записана в виде взвешенной суммы дельта-функций:</p>
          <equation-wrapper v-model="equation.e_1_8"></equation-wrapper>
          <p>Последовательность x(nT) называется периодической, если она удовлетворяет условию:
            <equation-wrapper v-model="localEquation.e_3"></equation-wrapper>, где
          </p>
          <ul>
            <li>m и N - целые числа, m = 0, 1, 2, ..., NT</li>
            <li><em>NT</em> - период дискретной последовательности.</li>
          </ul>
          <h4>Z-преобразование</h4>
          <p>Дискретные последовательности очень удобно описывать с помощью <strong>Z-формы</strong> или Z-преобразований.
          </p>
          <p><em>Z-преобразование</em> - аналог преобразования Лапласа в дискретной форме. Для дискретной
            последовательности
            x(nT) одностороннее Z-преобразование определяется следующим рядом:</p>
          <equation-wrapper v-model="equation.e_1_9"></equation-wrapper>
          <p>где <span> <equation-wrapper v-model="localEquation.e_4"></equation-wrapper></span> - комплексная функция,
            X(z) - это Z-форма последовательности x(nT).</p>
          <p>Z-преобразование связано с преобразованием Лапласа через формулу:</p>
          <equation-wrapper v-model="equation.e_1_10"></equation-wrapper>
          <h4>Свойства Z-преобразования</h4>
          <ol>
            <li><strong>Линейность</strong></li>
          </ol>
          <p>Если последовательность x(nT) можно представить в виде линейной комбинации <equation-wrapper
              v-model="equation.e_1_11"></equation-wrapper></p>
          <p> то <equation-wrapper v-model="equation.e_1_12"></equation-wrapper></p>
          <p>Иными словами, Z-преобразование суммы сигналов равно сумме z-образов этих сигналов.</p>
          <ol start="2">
            <li><strong>Задержка (сдвиг по времени)</strong></li>
          </ol>
          <equation-wrapper v-model="equation.e_1_13"></equation-wrapper>
          <p>Задержка входного сигнала на m вносит добавочный множитель
            <equation-wrapper v-model="localEquation.e_5"></equation-wrapper>
          </p>
          <ol start="3">
            <li><strong>Свертка</strong></li>
          </ol>
          <p>Для последовательности y(nT) свертка двух последовательностей равна:</p>
          <equation-wrapper v-model="equation.e_1_14"></equation-wrapper>
          <p>или</p>
          <equation-wrapper v-model="equation.e_1_15"></equation-wrapper>
          <p>А для Z-формы:</p>
          <equation-wrapper v-model="equation.e_1_16"></equation-wrapper>
          <p>Z-преобразование свёртки сигналов равно произведению их Z-образов.</p>
          <p>Если входной сигнал x(nT) представить в виде взвешенной суммы δ-функций, то Z-форма принимает вид</p>
          <equation-wrapper v-model="equation.e_1_17"></equation-wrapper>
        </div>
      </n-tab-pane>
    </n-tabs>
  </div>
</template>

<script>
import { NTabs, NTabPane } from "naive-ui";
import 'katex/dist/katex.css';

import EquationWrapper from "./EquationWrapper.vue"
import { TheoryEquations as equation } from "@/content/theoryEquations";

export default {
  components: {
    NTabs,
    NTabPane,
    EquationWrapper
  },
  data() {
    return {
      equation,
      localEquation: {
        e_1: `\\omega = 2\\pi/T`,
        e_2: `\\Delta f`,
        e_3: `x(nT) = x(nT+mNT)`,
        e_4: `z = Re(z) + j \\cdot Im(z)`,
        e_5: `z^{-m}`,
        F_a: 'F_a'
      }
    };
  },
  computed: {},
  mounted() {
  },
  methods: {
  },
};
</script>
